<?php 
/**
 * คลาส Booking ใช้สำหรับจัดเก็บข้อมูลการจอง
 * 
 * ตัวอย่างการใช้งาน:
 * title: 'Meeting',                // ชื่อหัวข้อของการจอง
 * start: new Date(y, m, d, 10, 30), // เวลาที่เริ่มต้นการจอง
 * allDay: false,                    // กำหนดว่าเป็นกิจกรรมทั้งวันหรือไม่
 * backgroundColor: "#0073b7",       // สีพื้นหลังของกิจกรรม (สีน้ำเงิน)
 * borderColor: "#0073b7"            // สีเส้นขอบของกิจกรรม (สีน้ำเงิน)
 */

class Booking {
	
	// กำหนดคุณสมบัติของการจอง
	public $title;             // ชื่อกิจกรรม
	public $start;             // วันที่และเวลาที่เริ่มต้น
	public $allDay = false;    // ระบุว่าเป็นกิจกรรมทั้งวันหรือไม่ (ค่าเริ่มต้น false)
	public $backgroundColor;   // สีพื้นหลังของกิจกรรม
	public $borderColor;       // สีเส้นขอบของกิจกรรม
	public $url;               // ลิงก์ URL เพื่อแสดงข้อมูลเพิ่มเติม
	public $className;         // ชื่อคลาส CSS เพื่อปรับแต่ง
	public $block = false;     // ระบุว่ากิจกรรมถูกบล็อกหรือไม่ (ค่าเริ่มต้น false)
		
	// คอนสตรักเตอร์สำหรับกำหนดค่าชื่อกิจกรรมและเวลาเริ่มต้น
	public function __constructor($t, $s) {
		$this->title = $t;  // ตั้งค่าชื่อกิจกรรม
		$this->start = $s;  // ตั้งค่าเวลาเริ่มต้น
	}
}
?>
